# -*- coding: utf-8 -*-
"""
Created on Mon Sep  9 18:49:53 2024

@author: K_L
"""

# 题目：
# 809*??=800*??+9*?? 其中??代表一个两位数,
# 809*??为四位数，
# 8*??的结果为两位数，
# 9*??的结果为3位数。
# 求??代表的两位数，及809*??后的结果。

for i in range(10, 100):
    if (809 * i <= 10000) \
            and (8 * i < 100) \
            and (9 * i >= 100) \
            and (809 * i == 800 * i + 9 * i):
        print("?? 代表的两位数是 %d\n"
              "809 * %d = 800 * %d + 9 * %d = % d"
              % (i, i, i, i, 809*i))
        break
